# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'dnsmasq'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'go'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'trash'
brew 'wget'

# PHP
brew 'php70', args: ['with-debug', 'without-apache']

# Apps
cask 'appcleaner'
cask 'atom'
cask 'cloudup'
cask 'dockertoolbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'hubic'
cask 'iterm2'
cask 'malwarebytes-anti-malware'
cask 'moom'
cask 'mumble'
cask 'owncloud'
cask 'owncloud'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro'
cask 'sketch'
cask 'sketch-toolbox'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'vagrant'
cask 'ukelele'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
